In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('train.csv')
df.shape

(100000, 12)

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,1,"Oconnor, Frankie",male,NaN,2,0,209245,27.14,C12239,S
1,1,0,3,"Bryan, Drew",male,NaN,0,0,27323,13.35,NaN,S
2,2,0,3,"Owens, Kenneth",male,0.33,1,2,CA 457703,71.29,NaN,S
3,3,0,3,"Kramer, James",male,19.00,0,0,A. 10866,13.04,NaN,S
4,4,1,3,"Bond, Michael",male,25.00,0,0,427635,7.76,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
99995,99995,1,2,"Bell, Adele",female,62.00,0,0,PC 15008,14.86,D17243,C
99996,99996,0,2,"Brown, Herman",male,66.00,0,0,13273,11.15,NaN,S
99997,99997,0,3,"Childress, Charles",male,37.00,0,0,NaN,9.95,NaN,S
99998,99998,0,3,"Caughlin, Thomas",male,51.00,0,1,458654,30.92,NaN,S
99999,99999,0,3,"Enciso, Tyler",male,55.00,0,0,458074,13.96,NaN,S

In [4]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,100000.000000,100000.000000,100000.000000,96708.000000,100000.000000,100000.000000,99866.00000
mean,49999.500000,0.427740,2.106910,38.355472,0.397690,0.454560,43.92933
std,28867.657797,0.494753,0.837727,18.313556,0.862566,0.950076,69.58882
min,0.000000,0.000000,1.000000,0.080000,0.000000,0.000000,0.68000
25%,24999.750000,0.000000,1.000000,25.000000,0.000000,0.000000,10.04000
50%,49999.500000,0.000000,2.000000,39.000000,0.000000,0.000000,24.46000
75%,74999.250000,1.000000,3.000000,53.000000,1.000000,1.000000,33.50000
max,99999.000000,1.000000,3.000000,87.000000,8.000000,9.000000,744.66000

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 11 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   PassengerId  100000 non-null  int64
 1   Survived     100000 non-null  int64
 2   Pclass       100000 non-null  int64
 3   Name         100000 non-null  object
 4   Sex          100000 non-null  object
 5   Age          96708 non-null   float64
 6   SibSp        100000 non-null  int64
 7   Parch        100000 non-null  int64
 8   Ticket       95377 non-null   object
 9   Fare         99866 non-null   float64
 10  Embarked     99750 non-null   object
dtypes: float64(2), int64(5), object(4)
memory usage: 8.4+ MB

In [5]:
# Сколько пустых ячеек в каждой колонке
df.isna().sum()

PassengerId        0
Survived           0
Pclass             0
Name               0
Sex                0
Age             3292
SibSp              0
Parch              0
Ticket          4623
Fare             134
Cabin          67866
Embarked         250
dtype: int64

In [6]:
# Подсчитаем сколько рядов с хотя бы одним пропущеным значением
count_missed = df.shape[0] - df.dropna().shape[0]
count_missed

69119

In [10]:
df.nunique()

PassengerId    100000
Survived            2
Pclass              3
Name            92144
Sex                 2
Age               173
SibSp               7
Parch               8
Ticket          75331
Fare            15935
Embarked            3
dtype: int64

In [8]:
df = df.drop(['Cabin'], axis='columns')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,0,1,1,"Oconnor, Frankie",male,NaN,2,0,209245,27.14,S
1,1,0,3,"Bryan, Drew",male,NaN,0,0,27323,13.35,S
2,2,0,3,"Owens, Kenneth",male,0.33,1,2,CA 457703,71.29,S
3,3,0,3,"Kramer, James",male,19.00,0,0,A. 10866,13.04,S
4,4,1,3,"Bond, Michael",male,25.00,0,0,427635,7.76,S
...,...,...,...,...,...,...,...,...,...,...,...
99995,99995,1,2,"Bell, Adele",female,62.00,0,0,PC 15008,14.86,C
99996,99996,0,2,"Brown, Herman",male,66.00,0,0,13273,11.15,S
99997,99997,0,3,"Childress, Charles",male,37.00,0,0,NaN,9.95,S
99998,99998,0,3,"Caughlin, Thomas",male,51.00,0,1,458654,30.92,S
99999,99999,0,3,"Enciso, Tyler",male,55.00,0,0,458074,13.96,S

In [9]:
df.isna().sum()

PassengerId       0
Survived          0
Pclass            0
Name              0
Sex               0
Age            3292
SibSp             0
Parch             0
Ticket         4623
Fare            134
Embarked        250
dtype: int64

# Context

# Data quality assessment

# Data exploration

# Summary